In [1]:
import pandas as pd

In [ ]:
dict_data = {'a' : 1, "b" : 2, "c" : 3}

In [ ]:
sr = pd.Series(dict_data)

In [ ]:
print(type(sr))

In [ ]:
print("\n")

In [ ]:
print(sr)

In [ ]:
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
sr

In [ ]:
idx = sr.index
val = sr.values

In [ ]:
print(idx)
print(val)

In [ ]:
tup_data = ("영인", "2010-05-01", "여", True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])

In [ ]:
print(sr)

In [ ]:
print(sr[0])

In [ ]:
print(sr["이름"])

In [ ]:
print(sr[[1, 2]])

In [ ]:
print(sr[[""]])

### 2-2 데이터 프레임

In [2]:
dict_data = {'c0' : [1, 2, 3], 'c1' : [4, 5, 6], 'c2' : [7, 8, 9], 'c3' : [10, 11, 12], 'c4' : [13, 14, 15]}
df = pd.DataFrame(dict_data)

In [3]:
print(type(df))
print('\n')
print(df)

<class 'pandas.core.frame.DataFrame'>


   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [15]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                 index=["준서", "예은"],
                 columns=["나이", "성별", "학교"])
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [16]:
df.index=["학생1","학생2"]
df.columns=["연령","남녀","소속"]

print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [17]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                 index=["준서", "예은"],
                 columns=["나이", "성별", "학교"])

In [18]:
df.rename(columns={"나이":"연령", "성별":"남녀", "학교":"소속"}, inplace=True)
df.rename(index={"준서":"학생1","예은":"학생2"}, inplace=True)

print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [19]:
exam_data = {'수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [20]:
df2 = df[:]
df2.drop('우현', inplace= True)
print(df2)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

C:\Users\hkdly\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [23]:
df3 = df[:]
df3.drop(['우현', '인아'], axis=0 , inplace= True)
print(df3)

    수학  영어  음악   체육
서준  90  98  85  100

C:\Users\hkdly\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [24]:
exam_data = {'수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

df4 = df[:]
df4.drop('수학', axis=1 , inplace= True)
print(df4)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [25]:
df5 = df[:]
df5.drop(['영어', '음악'], axis=1 , inplace= True)
print(df5)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [26]:
exam_data = {'수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

label1 = df.loc['서준']
position1 = df.iloc[0]
print(label1)
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [27]:
label2 = df.loc[['서준', '우현']]
position2 = df.iloc[[0,1]]
print(label2)
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [28]:
label3 = df.loc['서준': '우현']
position3 = df.iloc[0:1]
print(label3)
print(position3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100

In [30]:
exam_data = {'이름' : ['서준', '우현', '인아'],
            '수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [32]:
match1 = df['수학']
print(match1)

0    90
1    80
2    70
Name: 수학, dtype: int64

In [33]:
english = df.영어
print(english)
print(type(english))

0    98
1    89
2    95
Name: 영어, dtype: int64
<class 'pandas.core.series.Series'>

In [34]:
music_gym = df[['음악', '체육']]
print(music_gym)
print(type(music_gym))

    음악   체육
0   85  100
1   95   90
2  100   90
<class 'pandas.core.frame.DataFrame'>

In [36]:
df.iloc[: : 1]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [2]:
exam_data = {'이름' : ['서준', '우현', '인아'],
            '수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data)

df.set_index('이름', inplace =True)
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [3]:
a = df.loc['서준','음악']
a

85

In [5]:
c =df.iloc[0,2]
c

85

In [6]:
b = df.loc['서준',['음악','체육']]
b

음악     85
체육    100
Name: 서준, dtype: int64

In [8]:
d = df.iloc[0,2:]
d

음악     85
체육    100
Name: 서준, dtype: int64

In [10]:
df['국어'] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [14]:
exam_data = {'이름' : ['서준', '우현', '인아'],
            '수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data)

In [15]:
df.loc[3] = 0
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

In [16]:
df.loc[4] = ['동규', 90, 80, 70, 60]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

In [18]:
df.loc['행5'] = df.loc[3]
df

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100   90
3    0   0   0    0    0
4   동규  90  80   70   60
행5   0   0   0    0    0

In [19]:
exam_data = {'이름' : ['서준', '우현', '인아'],
            '수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data)

In [20]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [25]:
df.iloc[0][3] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [26]:
df.loc['서준']['체육'] = 90
df

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [29]:
df.loc['서준','체육'] = 100
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [30]:
df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [33]:
df.iloc[0,[2,3]] = 60, 100
df

    수학  영어   음악   체육
이름
서준  90  98   60  100
우현  80  89   95   90
인아  70  95  100   90

In [34]:
df.loc['서준',['음악','체육']] = 100,50
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

In [39]:
exam_data = {'이름' : ['서준', '우현', '인아'],
            '수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data)

In [40]:
df= df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [41]:
df =df.T
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [3]:
exam_data = {'이름' : ['서준', '우현', '인아'],
            '수학':[90, 80, 70],'영어':[98, 89, 95],
            '음악':[85, 95, 100],'체육':[100, 90, 90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [4]:
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [5]:
ndf2 = df.set_index(['음악'])
ndf2

     이름  수학  영어   체육
음악
85   서준  90  98  100
95   우현  80  89   90
100  인아  70  95   90

In [6]:
ndf3 = df.set_index(['음악','수학'])
ndf3

        이름  영어   체육
음악  수학
85  90  서준  98  100
95  80  우현  89   90
100 70  인아  95   90

In [7]:
dict_data = {'c0' : [1, 2, 3], 'c1':[4, 5 ,6], "c2":[7, 8, 9],"c3":[10, 11, 12], "c4":[13, 14, 15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [8]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [9]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [10]:
dict_data = {'c0' : [1, 2, 3], 'c1':[4, 5 ,6], "c2":[7, 8, 9],"c3":[10, 11, 12], "c4":[13, 14, 15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [11]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [12]:
dict_data = {'c0' : [1, 2, 3], 'c1':[4, 5 ,6], "c2":[7, 8, 9],"c3":[10, 11, 12], "c4":[13, 14, 15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [14]:
ndf = df.sort_index(ascending=True)
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [ ]:
dict_data = {'c0' : [1, 2, 3], 'c1':[4, 5 ,6], "c2":[7, 8, 9],"c3":[10, 11, 12], "c4":[13, 14, 15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

In [1]:
import pandas as pd

In [2]:
student1 = pd.Series( {'국어':100, '영어':80, '수학':90} )
print(student1)

국어    100
영어     80
수학     90
dtype: int64

In [4]:
percentage = student1 / 200
print(percentage)
print(type(percentage))

국어    0.50
영어    0.40
수학    0.45
dtype: float64
<class 'pandas.core.series.Series'>

In [5]:
student1 = pd.Series( {'국어':100, '영어':80, '수학':90} )
student2 = pd.Series( {'수학':80, '국어':90, '영어':80} )
print(student1)
print(student2)

국어    100
영어     80
수학     90
dtype: int64
수학    80
국어    90
영어    80
dtype: int64

In [6]:
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2
print(type(division))

<class 'pandas.core.series.Series'>

In [7]:
result = pd.DataFrame([addition, subtraction, multiplication, division], index=['덧셈', '뺄셈', '곰셈', '나눗셈'])
print(result)

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곰셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [8]:
import numpy as np

In [9]:
student1 = pd.Series( {'국어':np.nan, '영어':80, '수학':90} )
student2 = pd.Series( {'수학':80, '국어':90} )
print(student1)
print(student2)

국어     NaN
영어    80.0
수학    90.0
dtype: float64
수학    80
국어    90
dtype: int64

In [10]:
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2
print(type(division))

<class 'pandas.core.series.Series'>

In [11]:
result = pd.DataFrame([addition, subtraction, multiplication, division], index=['덧셈', '뺄셈', '곰셈', '나눗셈'])
print(result)

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곰셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [12]:
student1 = pd.Series( {'국어':np.nan, '영어':80, '수학':90} )
student2 = pd.Series( {'수학':80, '국어':90} )

In [13]:
sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)
sr_mul = student1.mul(student2, fill_value=0)
sr_div = student1.div(student2, fill_value=0)

In [14]:
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], index=['덧셈', '뺄셈', '곰셈', '나눗셈'])
print(result)

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곰셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

In [15]:
import seaborn as sns

In [17]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
print(df.head())
print(type(df))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
<class 'pandas.core.frame.DataFrame'>

In [18]:
addition = df + 10
print(addition.head())
print(type(addition))

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500
<class 'pandas.core.frame.DataFrame'>

In [19]:
print(df.tail())

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [20]:
addition = df + 10
print(df.tail())

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [21]:
substaction = addition - df
print(substaction.tail())

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0